In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

from numpy.random import randn

In [2]:
ser1 = Series(np.arange(3),index=['a','b','c'])
ser1 = 2*ser1
ser1

a    0
b    2
c    4
dtype: int32

In [3]:
# selecting entry by its index label
ser1['b']

2

In [4]:
# selecting entry by its index(not index label)
ser1[1]

2

In [5]:
# grabbing by range
ser1[0:3]

a    0
b    2
c    4
dtype: int32

In [6]:
# selecting a range of entrie by its index label
ser1[['a','b']]

a    0
b    2
dtype: int32

In [7]:
# selecting by logic/condition
ser1[ser1>3]

c    4
dtype: int32

In [8]:
# selecting entry by logic and replacing its value
ser1[ser1>3] = 10
ser1

a     0
b     2
c    10
dtype: int32

In [9]:
dframe = DataFrame(np.arange(25).reshape((5,5)), index=['NYC','LA','SF','DC','Chi'],columns=['A','B','C','D','E'])
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [10]:
# selecting a single column
dframe['B']

NYC     1
LA      6
SF     11
DC     16
Chi    21
Name: B, dtype: int32

In [11]:
# selecting multiple columns
dframe[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
Chi  21  24

In [12]:
#selecting column by condition
dframe[dframe['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [13]:
# boolean dframe
dframe>10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [14]:
# selecting a row, use .iloc if index label = intergers, .loc when index label = char/string
dframe.loc['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

In [17]:
# selecting the same row as above by its index instead of its index label
dframe.iloc[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32